<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"dceddfab9a4b02de0e35cf849549833fa013da5012c2cc21dadcae410b7f10b9","plan_job_ref":"Job Plan org changes and list them in a PR #149 at https://github.com/django-commons/membership/actions/runs/17831598856","plan_out_hash":"8dc0e638fa38a090131e9bf597fc6770d951217e0d797af62b6c302ac5a3a42c","plan_hash":"ccdc23129a06c29a046a8a7f05bf5b63d8355dea260de0b3d58df8d0a4d80325","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__
With var files: `terraform/production/org.tfvars
terraform/production/repositories.tfvars
`
With variables: `github_token = (sensitive value)`
<details>
<summary>Plan: 2 to import, 11 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # github_repository.this["axe-selenium-python"] will be updated in-place
  # (imported from "axe-selenium-python")
!~  resource "github_repository" "this" {
        allow_auto_merge            = false
        allow_merge_commit          = false
        allow_rebase_merge          = true
        allow_squash_merge          = true
!~      allow_update_branch         = false -> true
+       archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
!~      description                 = "aXe Selenium Integration python package" -> "Automated web accessibility testing with Axe and Selenium"
        etag                        = "W/\"dd537a31859a6e62b3485ac5fee9a6588c69ad33965bbf3283a8439872df4e59\""
        full_name                   = "django-commons/axe-selenium-python"
        git_clone_url               = "git://github.com/django-commons/axe-selenium-python.git"
        has_discussions             = true
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = false
-       homepage_url                = "https://pypi.python.org/pypi/axe-selenium-python/" -> null
        html_url                    = "https://github.com/django-commons/axe-selenium-python"
        http_clone_url              = "https://github.com/django-commons/axe-selenium-python.git"
        id                          = "axe-selenium-python"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "axe-selenium-python"
        node_id                     = "********************************"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 94129364
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:django-commons/axe-selenium-python.git"
        svn_url                     = "https://github.com/django-commons/axe-selenium-python"
        topics                      = []
        visibility                  = "public"
!~      vulnerability_alerts        = false -> true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_collaborators.this["axe-selenium-python"] will be updated in-place
  # (imported from "axe-selenium-python")
!~  resource "github_repository_collaborators" "this" {
        id             = "axe-selenium-python"
        invitation_ids = {}
        repository     = "axe-selenium-python"

        team {
            permission = "pull"
            team_id    = "*************"
        }
+       team {
+           permission = "admin"
+           team_id    = (known after apply)
        }
+       team {
+           permission = "maintain"
+           team_id    = (known after apply)
        }
+       team {
+           permission = "triage"
+           team_id    = (known after apply)
        }
    }

  # github_repository_environment.pypi["axe-selenium-python"] will be created
+   resource "github_repository_environment" "pypi" {
+       can_admins_bypass   = true
+       environment         = "pypi"
+       id                  = (known after apply)
+       prevent_self_review = false
+       repository          = "axe-selenium-python"

+       reviewers {
+           teams = (known after apply)
        }
    }

  # github_repository_environment.testpypi["axe-selenium-python"] will be created
+   resource "github_repository_environment" "testpypi" {
+       can_admins_bypass   = true
+       environment         = "testpypi"
+       id                  = (known after apply)
+       prevent_self_review = false
+       repository          = "axe-selenium-python"
    }

  # github_team.repo_admin_team["axe-selenium-python"] will be created
+   resource "github_team" "repo_admin_team" {
+       create_default_maintainer = false
+       description               = "Admin team for the axe-selenium-python repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "axe-selenium-python-admins"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_committer_team["axe-selenium-python"] will be created
+   resource "github_team" "repo_committer_team" {
+       create_default_maintainer = false
+       description               = "Committers team for the axe-selenium-python repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "axe-selenium-python-committers"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_team["axe-selenium-python"] will be created
+   resource "github_team" "repo_team" {
+       create_default_maintainer = false
+       description               = "Main team for the axe-selenium-python repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "axe-selenium-python"
+       node_id                   = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team_members.repo_admin_members["axe-selenium-python"] will be created
+   resource "github_team_members" "repo_admin_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "knyghty"
        }
+       members {
+           role     = "member"
+           username = "thibaudcolas"
        }
    }

  # github_team_members.repo_team_members["axe-selenium-python"] will be created
+   resource "github_team_members" "repo_team_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "knyghty"
        }
+       members {
+           role     = "member"
+           username = "thibaudcolas"
        }
    }

  # github_team_repository.repo_admin_team_access["axe-selenium-python"] will be created
+   resource "github_team_repository" "repo_admin_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "admin"
+       repository = "axe-selenium-python"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_committer_team_access["axe-selenium-python"] will be created
+   resource "github_team_repository" "repo_committer_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "maintain"
+       repository = "axe-selenium-python"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_team_access["axe-selenium-python"] will be created
+   resource "github_team_repository" "repo_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "triage"
+       repository = "axe-selenium-python"
+       team_id    = (known after apply)
    }

  # github_team_settings.this["axe-selenium-python"] will be created
+   resource "github_team_settings" "this" {
+       id        = (known after apply)
+       team_id   = (known after apply)
+       team_slug = (known after apply)
+       team_uid  = (known after apply)

+       review_request_delegation {
+           algorithm    = "LOAD_BALANCE"
+           member_count = 2
+           notify       = false
        }
    }

Plan: 2 to import, 11 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan org changes and list them in a PR #149](https://github.com/django-commons/membership/actions/runs/17831598856)